[
    {
        "title": "Stock growth in TSLA after election results",
        "text": "After searching online I couldn't find a solid reason why tesla stocks have more than doubled since Trump was announced the next president. I know that tesla year over year financials are looking pretty great, but what does Trump have to do with this value increase?\nIs there some kind of tax break he will be implementing? Is it because Musk was a strong supporter for Trump? \nJust curious if anyone saw something I missed. \n\nEdit: is this downvoted because you don't like Trump/Musk or because there was a big run and you missed it? Really just curious if there was a factual reason for the change. \n",
        "score": 0,
        "url": "https://www.reddit.com/r/investing/comments/1hfm59r/stock_growth_in_tsla_after_election_results/",
        "id": "1hfm59r",
        "author": "CoffeeWhiskeyAndData",
        "comments": 32,
        "comment_list": [
            {
                "body": "\\> Is it because Musk was a strong supporter for Trump?\n\nYes. This is the reason. And now the market expects Trump to return the favor.",
                "author": "likwid07",
                "created": 1734365057.0
            },
            {
                "body": "It’s a meme stock now, so it’s valued more like bitcoin than a real company. People invest because they believe in Musk and have fomo. What Trump wants to do is bad for Tesla- eliminate fuel efficiency standards, eliminate ev incentives, and raise tariffs. Tesla’s self driving plan appears to be smoke and mirrors, and the cybertruck is not selling well. Musk is also toxic to a large chunk of potential ev buyers and is at war with CA government, where a ton of Teslas are sold. By all realistic measures Tesla should be slumping.",
                "author": "efisk666",
                "created": 1734367094.0
            },
            {
                "body": "Cronyism.  Someone else will explain this better with more detail than me but thats the simple answer - corruption.",
                "author": "CapillaryClinton",
                "created": 1734364674.0
            },
            {
                "body": "Relaxed regulations surrounding autonomous vehicles and driving is the big one.\n\nAlso reducing EV incentives benefits TSLA as they have better margins than anyone else.\n\nI exited my 2027 $650 calls at $430 fwiw. Think I’ll have another opportunity to buy sub $400. You’re correct in that little has actually changed since the election. So I’m not super bullish after such a run",
                "author": "Dumb_Nuts",
                "created": 1734365083.0
            },
            {
                "body": "It is a curious drive upward in valuation... \n\nIn my mind, his allegiance with Trump will turn off half the country - case and point, my wife won't even rent a Tesla now. The other half the country won't drive EVs bc global warming isn't real and EVs are \"woke\".\n\nSooooo, who's going to be buying a Tesla??? For real, make it make sense.",
                "author": "AdHumble5046",
                "created": 1734367179.0
            },
            {
                "body": "If you're trying to reconcile stock price action with facts, data, or fundamentals, you have much to learn about the stock market.\n\nStocks outrun the fundamentals both to the upside and downside on a regular basis based on whatever hot narrative is in play in any given news cycle.",
                "author": "cwsReddy",
                "created": 1734365120.0
            },
            {
                "body": "If Ford CEO Farley was hanging around Trump you'd see an unjustified runup in F.    Well, he'd probably still bungle it, but the point is - being able to chit chat with the President and being in his inner circle is considered valuable.",
                "author": "LiveRedAnon",
                "created": 1734365813.0
            },
            {
                "body": "Welcome to the economy that is both supported by democratic policies and republican FOMO about whatever future they're being sold until reality sets in.\n\n\n\nGet it while its hot. It won't last long.",
                "author": "Iggyhopper",
                "created": 1734365796.0
            },
            {
                "body": "Money is speech brah. If you can buy more speech you buy more influence, when you buy more influence you get more goodies from the govt.",
                "author": "dasdas90",
                "created": 1734365295.0
            },
            {
                "body": "lol you sweet summer child.\n\nYou think Elon’s support during the election was FREE and doesn’t come with a solid expectation of reciprocity?",
                "author": "YetiPwr",
                "created": 1734367107.0
            },
            {
                "body": "Are you serious? TSLA is already extremely overvalued based on fundamentals, it's always been a speculation play based on Musk selling some new pipe dream combined with gov subsidies. Of course it's going to go up now that he's getting hands on access to gov funding.",
                "author": "mastawyrm",
                "created": 1734367651.0
            },
            {
                "body": "I assume it is because all the billionaires in our new Plutocracy are buying in on his false narrative.",
                "author": "Dadd_io",
                "created": 1734365903.0
            },
            {
                "body": "TSLA self-driving is scientifically incapable of full self-driving safely without lidar and radar due to the limitations of camera-only vision systems.  Elon is counting on Trump and the GOP to get rid of the regulations keeping it from being released on the American public despite its poor safety record.  I personally can't imagine who is going to use it or buy into it once more deaths are happening as a result of its deployment.",
                "author": "Dadd_io",
                "created": 1734366088.0
            },
            {
                "body": "The Biden administration was specifically targeting Tesla because of Musk's political views. Now that the Biden administration is going away, that means the federal government is much less likely to pursue politically motivating attacks against Tesla. Pretty straightforward.",
                "author": "yad76",
                "created": 1734365542.0
            }
        ]
    },
    {
        "title": "Question about Samsung Electronics (SSNLF)",
        "text": "Hey guys! \n\nThis is a quick question: is it possible to invest into Samsung Electronics from any typical American brokerage app like Think Or Swim? Oddly, whenever I look at that stock in particular, it looks super broken and no charts ever display for it either. \n\nIt made me wonder if Samsung is a legit stock in the Us stock exchange. \n\n\nAny thoughts or answers? I'm just curious.",
        "score": 0,
        "url": "https://www.reddit.com/r/investing/comments/1hflcz4/question_about_samsung_electronics_ssnlf/",
        "id": "1hflcz4",
        "author": "fvanguard",
        "comments": 1,
        "comment_list": []
    },
    {
        "title": "Taxes: Rolling my short leg of call spread to next year",
        "text": "I purchased several 60/95 call spreads expiring in January 2026. Currently, the stock is at $90, and I’m considering rolling my short January 2026 95C to a January 202**7** 130C at close to zero cost (buying the 95C for $20 and selling the 130C for $20). If it helps, the stock is the TQQQ ETF.\n\nThe P&L on the short 95C is -$150k. Can I offset this loss against my realized profit (due to other trades) for this year, or would the \"call roll\" trigger a wash sale?\n\nthanks",
        "score": 0,
        "url": "https://www.reddit.com/r/investing/comments/1hfl8xb/taxes_rolling_my_short_leg_of_call_spread_to_next/",
        "id": "1hfl8xb",
        "author": "ash-t-1",
        "comments": 0,
        "comment_list": []
    },
    {
        "title": "2.5 year follow-up on buying the dip on pandemic stocks",
        "text": "I bought the dip on several 'pandemic stocks' that had significant declines (70%+) in 2022 and started sharing public updates 1-2 times a year.\n\nIn Q3 2023 I began reallocating into AI-related stocks when I developed strong conviction. I'm also working on a self-funded AI startup, which keeps me in the loop on AI.\n\nReturns have been strong and continue to give me the runway to work on my startup and support my family after leaving my corporate tech job. There's more context in my previous updates linked below.\n\n**Previous updates:**\n\n* [1 year follow-up on buying the dip on pandemic stocks](https://www.reddit.com/r/investing/comments/147v53k/1_year_followup_on_buying_the_dip_on_pandemic/)\n* [1.5 year follow-up on buying the dip on pandemic stocks](https://www.reddit.com/r/investing/comments/17mzc07/15_year_followup_on_buying_the_dip_on_pandemic/)\n* [2 year follow-up on buying the dip on pandemic stocks](https://www.reddit.com/r/investing/comments/1d758m7/2_year_followup_on_buying_the_dip_on_pandemic/)\n\n# Progress updates\n\nBelow are the returns for this portfolio (opened in 2022) as of December 2024.\n\n# Realized (sold) in 2023\n\n* **Affirm (AFRM):** \\+18.09%\n* **Allbirds (BIRD):** \\+6.89%\n* **Coinbase (COIN):** \\+6.42%\n* **Carvana (CVNA):** \\+845.57%\n* **Meta (META):** \\+256.36%\n* **Cloudflare (NET):** \\+50.67%\n* **Netflix (NFLX):** \\+122.39%\n* **Peloton (PTON):** \\-71.51%\n* **Roblox (RBLX):** \\+25.57%\n* **Shopify (SHOP):** \\+51.27%\n* **Snapchat (SNAP):** \\-1.99%\n* **Unity (U):** \\+27.57%\n\nSee the [previous update](https://www.reddit.com/r/investing/comments/1d758m7/2_year_followup_on_buying_the_dip_on_pandemic/) for comments.\n\n# Realized (sold) in 2024\n\n* **Advanced Micro Devices (AMD):** \\-18.69% (\\*)\n* **Amazon (AMZN):** \\+97.41%\n* **Alphabet/Google (GOOGL):** \\+75.05%\n* **Apple (AAPL):** \\+8.77% (\\*)\n* **ARM (ARM):** \\+10.52% (\\*)\n* **ASML (ASML):** \\-7.40% (\\*)\n* **Intel (INTC):** \\-20.12% (\\*)\n* **Microsoft (MSFT):** \\+4.53% (\\*)\n* **Netflix (NFLX):** \\+361.74%\n* **Palantir (PLTR):** \\+65.72% (\\*)\n* **Roblox (RBLX):** \\+42.66%\n* **Shopify (SHOP):** \\+86.96%\n* **Snowflake (SNOW):** \\+51.57%\n* **Super Micro Computer (SMCI):** \\+14.48% (\\*)\n* **Taiwan Semiconductor (TSM):** \\+103.19%\n* **Tesla (TSLA):** \\+92.16% (\\*)\n* **Unity (U):** \\-8.73%\n\n(*\\*) Short term capital gain/loss held for <1yr*\n\nI held several companies (\\*) for a short time to spread out my AI bets, but some of the increasingly high P/E ratios concerned me (PLTR, TSLA, etc.).\n\nSo, I sold them and purchased more NVIDIA. This approach is considered risky, but I have strong conviction in their relative valuation, defensibility, and long-term prospects.\n\nIn this case I believe that 'diversification' among AI stocks would do more to dilute my returns than mitigate my risks. Particularly because they're all highly correlated and despite its market cap, Nvidia has the most reasonable valuation all things considered. We'll see if the bet pays off.\n\nTo clarify, I am confident in the long-term prospects of Palantir, Tesla, and others, but I'm just not comfortable with the valuations. I may reassess in the future when I have new information or valuations change.\n\nMeta is the only other stock I held onto, given my bullish view on their AI and hardware strategy combined with their attractive valuation.\n\n# Unrealized (current investments)\n\n* **Meta (META):** \\+367.97%\n* **Nvidia (NVDA):** \\+117.05%\n\nNvidia's performance here is understated since I recently increased my holdings, but it's up \\~200% since I initially purchased it last year after dithering for months.\n\nThese returns are less impactful without the values or relative weights, but I’d like to maintain some anonymity around it.\n\n# Rate of return (IRR)\n\nMy annual return (IRR) for this portfolio (Jun 2022 to Dec 2024) is **73.6%**.\n\n# Investment thesis\n\nSee a summary of my investment thesis in a [previous update](https://www.reddit.com/r/investing/comments/17mzc07/15_year_followup_on_buying_the_dip_on_pandemic/). **TL;DR:**\n\n>“…AI is another secular trend like PCs (Windows, Mac), the internet (browsers, search, social) and mobile (iOS, Android, wearables). The difference is that new technology like AI can now spread faster than ever before and get used in new ways. Every new epoch uniquely benefits from the past, potentially bending the growth curve in new ways.\n\nThe other difference is that Nvidia has a monopoly position on the core technology driving this innovation. Therefore, the \\~350% run up over the last 12 months doesn’t make NVIDIA the stock of the last year, but rather it’s the stock of the next decade. The recent 3X gain will be a blip compared to what’s coming thanks to NVIDIA’s CUDA (moat), among [other things](https://stratechery.com/2023/nvidia-on-the-mountaintop/).”\n\n\\- [1.5 year follow-up on buying the dip on pandemic stocks](https://www.reddit.com/r/investing/comments/17mzc07/15_year_followup_on_buying_the_dip_on_pandemic/), Nov. 2023\n\n# Nvidia's dominance\n\nI'm still working through my thoughts here, but my strong conviction around Nvidia comes in part from these observations:\n\n* Nvidia is [founder-led](https://www.amazon.com/Nvidia-Way-Jensen-Huang-Making/dp/1324086718/) and focuses on accelerated computing while remaining broad enough to allow for innovation and insight across industries where it can apply its core competencies.\n* It's unprecedented to have such dominance in such a fast-growing, valuable industry while maintaining such a long-term sustainable advantage.\n* This advantage is due to unreasonable investments (research, hardware, software, ecosystem, relationships) over decades, making it hard to copy.\n* AI will consistently make software easier to create, thus reducing the moats of software companies and make them less attractive than hardware companies (for now).\n* Despite their impressive growth, Nvidia is still supply constrained, which is fundamentally easier to predict than demand constraints.\n\n# We still underestimate the AI opportunity\n\nMost importantly, we’ve barely scratched the surface of AI’s opportunities and benefits. Even the most ambitious targets underestimate it because the better and cheaper AI gets, the more use cases we'll find.\n\nWe have a habit of confusing the limits of our imagination with the limits of reality. Our imaginations are trained on what happened before, but there has never been anything like this before.\n\n# Final thoughts\n\nI'm still well within the '*maybe I'm just lucky*' phase since it's only been a couple years. Towards the end of [my last update](https://www.reddit.com/r/investing/comments/1d758m7/2_year_followup_on_buying_the_dip_on_pandemic/) I also shared a few ways my investment approach has changed, which I’m still benefiting from.\n\nI expect my next update to be the 3-year update in mid 2025.\n\n**UPDATE:** Thanks for mentioning I should have included indexes for benchmark context. Indexes like QQQ and S&P 500 also had good returns during the same period (June 2022 - Dec 2024). For an apples to apples comparison, the IRR of QQQ and S&P 500 respectively during this period were \\~16% and \\~24%.",
        "score": 6,
        "url": "https://www.reddit.com/r/investing/comments/1hfjvh8/25_year_followup_on_buying_the_dip_on_pandemic/",
        "id": "1hfjvh8",
        "author": "gabe736",
        "comments": 20,
        "comment_list": [
            {
                "body": "For reference the S&P was up 58% in the same period (w/dividends reinvested), with near zero tax consequences.",
                "author": "FiIQ",
                "created": 1734359908.0
            },
            {
                "body": "My total rate of return for 2022 to 2024 is 96% doing nothing but buying QQQ",
                "author": "rcbjfdhjjhfd",
                "created": 1734359205.0
            },
            {
                "body": "What data points make you think AI has more to offer than incremental improvements over where we are at today?",
                "author": "tw0hearted",
                "created": 1734361823.0
            },
            {
                "body": "Now you need to calculate the taxes you had to pay doing this trading and calculate your total return.\nInvesting is about your total return after everything including taxes.",
                "author": "Awkward-Drop-6567",
                "created": 1734364157.0
            }
        ]
    },
    {
        "title": "I have $150 per week I can invest",
        "text": "I want to invest 50 in an s&f 500 Roth IRA, but with the remainder I want to evenly invest In a few independent stocks, and a robotics ETF I like. But I'm unsure of how to go about investing evenly between them all when I don't have the upfront cost to but the ETF/stocks in full each week.\nIs there a way to evenly devide your investments into fractions of stocks/funds?",
        "score": 0,
        "url": "https://www.reddit.com/r/investing/comments/1hfjt5f/i_have_150_per_week_i_can_invest/",
        "id": "1hfjt5f",
        "author": "leebonakiss",
        "comments": 14,
        "comment_list": [
            {
                "body": "You can do 90% of your money into sp500 or a broad etf and the rest into specific robotic stocks that you like",
                "author": "sifatullahrafy24",
                "created": 1734358412.0
            },
            {
                "body": "Yes, most brokerages allow you to buy fractional shares off of dollar amount instead of number of shares. $135/week will about max out a Roth. I'd do that, and drop the extra $15/week into your speculative plays.",
                "author": "someguyonredd1t",
                "created": 1734358838.0
            },
            {
                "body": "Just a quick easy piece of advice for you:\n\n\nAlways always always do your own research. Arguments out here can sound very convincing, but it's your money, and the person giving you the advice isn't losing your money for the suggestion, you are.",
                "author": "R50cent",
                "created": 1734361189.0
            },
            {
                "body": "If you're new to investing, I say stick to S&P for now while you do more market research. Once you found a position you're very confident with, split your investments 80/20. 80% to your choice of stocks and 20% to S&P 500. Good luck investing.",
                "author": "Collectsteve850",
                "created": 1734359711.0
            },
            {
                "body": "Assuming you have the earned income to do it, maxing out your Roth IRA FIRST will be the biggest benefit as it will be tax free growth. \n\nForget individual stocks for now, paint with a broad stroke. You are not a day trader. \n\nAny leftover beyond maxing your ira put in your favorite ETF and call it a day.\n\nMy wife and I are in our early 30s, we each have a 401k/457 that is maxed out yearly, invested primarily in small/mid cap funds. We also have a brokerage that we invest monthly spread across different ETF, like VOO, QQQ, etc. my wife also owns 200 shares of a blue chip stock that i encouraged her to purchase 4 years ago that is up 100% as of today, and we will continue to hold until we need the money. \n\nTime in the market is on your side. Max the Roth IRA for now. If your job offers a 401k i would invest at minimum up to the match. And then put money on the side into your favorite ETF.",
                "author": "No_Doughnut_1991",
                "created": 1734364956.0
            },
            {
                "body": "I'm new to investing and I'm just trying to wrap my head around everything, Thank you for your time!",
                "author": "leebonakiss",
                "created": 1734357978.0
            }
        ]
    },
    {
        "title": "Air France KLM - cheap for a reason, but too cheap to pass up?",
        "text": "I’m looking at Air France KLM as an option because of its low market cap. \n\nThe group is weighed down by massive debt they took during the pandemic. However operations are generating good cash flows. I can see this continuing, although there are serious challenges. \n\nAmsterdam airport looks set to further restrict the number of flights this year. It’s currently 483k a year, could drop another 5-10%. This is a blow to the group, although having the Air France arm does allow the group to flex operations away from AMS. Their future aircraft deliveries to KLM are all for higher capacity planes that should allow for some revenue growth even if flight numbers fall. KLM has also suggested they could delay new aircraft deliveries if flight numbers fall, which could improve cash flow. \n\nBoth Netherlands and France are due to raise taxes and fees paid by airlines. However i’d say its likely that this can passed onto the consumer as we are still in a capacity constrained environment, with airlines not able to get enough planes. \n\nIf you compare to similar airline groups, IAG has a very similar size fleet of aircraft and has a market cap 7(!) times that of AF KLM. Granted IAG has a much healthier balance sheet. But as outlined above, Air France KLM is generating cash so this should improve. \n\nLastly, both the French and Dutch governments have stakes in the business, so would likely assist if required. Airlines are symbolic, and the loss of both names is hard to fathom. \n\nSo at a market cap of €2Bn, for a massive (albeit debt riddled) business which is generating cash flows. Anyone else an investor or have thoughts?",
        "score": 0,
        "url": "https://www.reddit.com/r/investing/comments/1hfj9yd/air_france_klm_cheap_for_a_reason_but_too_cheap/",
        "id": "1hfj9yd",
        "author": "MP4_26",
        "comments": 4,
        "comment_list": [
            {
                "body": "The challenge for $AF is the eurozones's squeeze on aviation emissions (Frances upcoming shorthaul flight ban). Plus, their revenue base is highly sensitive to geopolitics right now. Even the Israeli-Palestine conflict impacted the bottom line.\n\nNet debt is down to circa €5bn, which is expected to lower - a good long term sign. A 2024 bond issuance of €650m  was oversubscribed 4.3x, generally another healthy sign from institutional investors.\n\nI'm not an expert in the industry though.",
                "author": "dayofdefeat_",
                "created": 1734358192.0
            },
            {
                "body": "Do they make any profit?",
                "author": "obb223",
                "created": 1734357646.0
            }
        ]
    },
    {
        "title": "Back door Roth, am I doing this right? ",
        "text": "48yo, I have been maxing out 401k for a while. I am above income limit for traditional Roth. I’m a W2 employee\n\nI opened a traditional IRA account and a Roth account. Plan to transfer $7k (taxed income)  from my bank account to the IRA, when it clears will then transfer to Roth, that is my 24 contribution. Will do the same with $7.5K Jan 1st, for my 25 contribution……. Is that it? ",
        "score": 5,
        "url": "https://www.reddit.com/r/investing/comments/1hfizqp/back_door_roth_am_i_doing_this_right/",
        "id": "1hfizqp",
        "author": "Apprehensive_Disk478",
        "comments": 7,
        "comment_list": [
            {
                "body": "That's it, except the 2025 contribution limit is still $7k.  It has not increased to $7.5k.\n\nAlso, just a minor correction, but \"traditional Roth\" is not a thing.  There is a traditional IRA and a Roth IRA.",
                "author": "McKnuckle_Brewery",
                "created": 1734355697.0
            },
            {
                "body": "That’s it. If you get any interest, roll that over too so that your 8606 shows 0 at the end of the year every year",
                "author": "dbolts1234",
                "created": 1734355705.0
            },
            {
                "body": "Yes",
                "author": "tboy1111",
                "created": 1734355717.0
            },
            {
                "body": "Thanks for quick replies, money transferred",
                "author": "Apprehensive_Disk478",
                "created": 1734356170.0
            },
            {
                "body": "Follow up question to OPs question - do you then put another 7k in the traditional IRA after you transferred the first 7k to the Roth?",
                "author": "AvocadoBeefToast",
                "created": 1734365548.0
            },
            {
                "body": "I like to use a trad IRA that has never taken pretax dollars ever (you dont need to open a new one each time, i leave it open, but i like knowing there cant be mix ups). Then make a \"nondeductible\" contribution to the trad IRA. The next day I convert to ROTH. That is the best practice.",
                "author": "Heyhayheigh",
                "created": 1734366049.0
            }
        ]
    },
    {
        "title": "Bank of America Outlook 2025: The most aggressive policy in a century in the United States will fuel a \"tech bubble,\" but \"the higher you climb, the harder you fall.\"",
        "text": "Bank of America warns that the U.S. stock market may have reached a critical point of collapse, potentially facing the dual impact of an Al bubble and the repercussions of Trump's policies next year. Al has similarities to the internet of the late 1990s, and the bubble's burst is only a matter of time. If Trump fulfills his campaign promises, it may bring a brief prosperity to the U.S. stock market, but it will also fuel the bubble, leading to a major depression.\n\nJust your typical sell-side fear mongering or does this actually make sense? ",
        "score": 156,
        "url": "https://www.reddit.com/r/investing/comments/1hfimg1/bank_of_america_outlook_2025_the_most_aggressive/",
        "id": "1hfimg1",
        "author": "GeneralOwn5333",
        "comments": 52,
        "comment_list": [
            {
                "body": "Also Bank of America (Dec-24)…\n\nBofA Global Research Expects 2025 to be a Year of Further Equity Market Strength Amid Macro Uncertainty\n\nBofA Economists and Strategists Forecast the US Economy to Continue to Outperform and the S&P 500 to Reach 6666 by Year-end",
                "author": "TestNet777",
                "created": 1734356607.0
            },
            {
                "body": "It’s a reasonable concern, but like all crash predictions the problem is timing. The market will always drop eventually, the question is if you’ll miss out on more growth by waiting or selling than the market drop is even going to be.\n\nI plan on being a bit more conservative with investments so I have dry powder, but I’m not holding my breath that the next crash is going to happen necessarily soon.",
                "author": "cakeandale",
                "created": 1734354951.0
            },
            {
                "body": "Bring it on, it’s gonna happen sooner or later and I’d rather this long over due correction hit while I’m young enough to bounce back.",
                "author": "awildjabroner",
                "created": 1734355439.0
            },
            {
                "body": "It’s hard to look at P/E ratios and NOT see a bubble. Stock markets are always due for a correction and right now hype is outweighing fundamentals for certain securities. \n\nI don’t see this tech bubble being as bad as 2008. A few firms will lose a metric mess of value but most will try to shed their bad investments quickly while there is political cover (see every company that cancelled projects during COVID) and focus on profits over vibes.",
                "author": "qu4f",
                "created": 1734355265.0
            },
            {
                "body": "It's hard to say whether the tech craze is a bubble or not. Sure the companies are highly valued but in the other hand there is a tremendous demand for the tech products. Computers and software are everywhere and I don't think we ve reached a point where all the needs are satisfied, wether on a business to business standpoint or for the general public.",
                "author": "Stanelis",
                "created": 1734357890.0
            },
            {
                "body": "A correction is overdue and I think it's more likely to happen during Trump's administration than after, maybe his ill conceived trade wars will be the impetus.",
                "author": "unbalancedcheckbook",
                "created": 1734360686.0
            },
            {
                "body": "If the tech bubble bursts everything else goes with it. This isnt 1980 where \"tech companies\" were just independant organizations separate from everything else. Nowadays tech bleeds into everything. Even modern cars now are essentially driving computers. A lot of non tech companies wouldnt even exist today if it wasnt for them being driven by tech. I really think a lot of people dont understand what TECH really means nowadays. Even when people shop now theyre all shopping from their phones and laptops. \n\nTo me the real worry is not private industry crashing. But the government debt going so high that they have to take emergency measures like slapping huge taxes on everything dragging to rest of the economy down with them.",
                "author": "Electronic-Will-2233",
                "created": 1734360873.0
            },
            {
                "body": "They have no clue",
                "author": "TimeGrifter",
                "created": 1734363100.0
            },
            {
                "body": "Ok calm down Michael Burry",
                "author": "MayIPikachu",
                "created": 1734355557.0
            },
            {
                "body": "Makes sense, drinks!",
                "author": "alexseiji",
                "created": 1734354786.0
            },
            {
                "body": "We'll see the drop come towards the end of 2025 after a few months of Trump policies.  Initially things will be good but reality will set in and we'll start seeing the effects.  Unemployment will shoot up, markets will crash 30-40%.   I don't see this as fear mongering but the natural course of things and Trump's policies will be the catalyst.",
                "author": "lm28ness",
                "created": 1734357659.0
            },
            {
                "body": "Well the yield curve did just uninvert.",
                "author": "-Mx-Life-",
                "created": 1734357739.0
            },
            {
                "body": "As someone who voted for Harris/Walz, I have to acknowledge that a Trump administration would likely roll back a significant number of regulations. This would create a more favorable environment for companies to pursue mergers, acquisitions, and expansion without fear of regulatory \"red tape.\"\n\nThe idea of a \"bubble\" in machine learning feels overblown. Unlike the '90s dot-com era, where companies with no products or revenue hit billion-dollar valuations based on hype, today’s market is built on real tech and revenue. Back then, a .com name and a flashy pitch were enough to attract massive investment, but when the bubble burst, most of those companies vanished. Machine learning has tangible use cases in healthcare, finance, and beyond — a far more solid foundation than a website with no business plan.",
                "author": "wirsteve",
                "created": 1734361756.0
            },
            {
                "body": "I’m concerned cause the short term risks are so tangible. \n\n1. We have no clue what policy’s the next administration will implement, the speed of which they’ll do it, and to what degree. Ex. I don’t think the market is pricing in him doing any of his tariffs which worries me. But if day 1 he signs a bunch of tariffs as a baseline I’d be worried. \n\n2. AI valuations are sky high and I think indexes are being propped up by these AI/tech companies. I don’t think the gains hold up. I have yet to see downstream customers be truly satisfied by AI services. I feel that most chip buying is by big players and downstream customers have not been subscribing to AI products en mass. Big tech can afford to buy up chips now and wait for the models to improve, but if there’s no increase in profits, valuations will have to adjust. \n\n(I point to the fact the CEO of Nvidia, Palantir, and Dell are selling massive amounts of their company stock. All three have massively benefitted from the AI run) \n\nEdit:\n3. Inflation is coming down but costs aren’t corrected.  Trump just stated that they probably won’t get lower anytime soon. Average consumer is at high risk of seeing their income decrease while costs remain high if not increase. \n\nMoves:\n- first time ever I’ve established a gold position\n- I’ve trimmed shares of individual company that may be overexposed to AI or potential tariffs. \n- I’m increasing my alternatives exposure (real estate, crypto, antiques, etc) \n- not selling my index funds unless seriously poor policies are enacted",
                "author": "Ap3X_GunT3R",
                "created": 1734363877.0
            },
            {
                "body": "More like a major shift than a crash. There are some companies who’s growing but still flattening in terms of stock price while some are extremely overvalued that even fast forward 20Y will still fail to justify the stock price. Means the index will be facing a consolidation except undervalued stocks with growth. \n\nIn such market with high efficiency, it’s still absurd to see even some staples stock will be given a high premium price including COSTCO, KO, WMT, MCD and etc.",
                "author": "Valueandgrowthare",
                "created": 1734358211.0
            },
            {
                "body": "BofA is both sell-side and buy-side.  I don't know if that commentary  was Savita Subramanian, you didn't link.  Even the best gurus are frequently wrong, but she is one of the best gurus out there.  \n\nI'm not nearly as bearish on the \"AI bubble\" as I've been on many other tech bubbles including the interet bubble of the 1990s.  The most worrying question is whether we have enough data to up the number of parameters. \n\nThat being said USA stock valuations in tech are very high.  If things don't work out those stocks could drop and as the market is much more tech heavy than it ever has been cap weighted indexes get hurt badly.   Most of the rest of the market isn't nearly so high.  International is still a terrific buy.",
                "author": "JeffB1517",
                "created": 1734358673.0
            },
            {
                "body": "As someone who is planning early retirement hopefully in the next few years it would be nice to get the crash over with beforehand instead of dreading when it will hit after I retire.  I don't want to think I'm finally free and then getting smashed with a 40% drop early on that even my fixed income will not save me from big damage.\n\n*Ideally* we would get price growth moderation while earnings catch up but markets usually don't work that way.  FOMO to drive it up way too high, then panic and everyone pulls out.",
                "author": "ptwonline",
                "created": 1734365453.0
            },
            {
                "body": "Not every bubble and correction needs to be devastating. AI hype driven stocks may correct, but I think tech and the market as a whole is going to be just fine. This reminds me more of when “disruption” was the hot topic a few years ago and Reddit was simping for Cathie Wood. A lot of those stocks experienced strong corrections, but if you weren’t invested in dumb memestocks and had a long term perspective you were fine.",
                "author": "NazReidBeWithYou",
                "created": 1734366781.0
            },
            {
                "body": "It's hard not to expect at least some sort of heavy pullback with AI investment. There's just not anything there, and I don't see how the big players can keep pumping billions of dollars into Capex investment for something that's proving to be simply evolutionary, not revolutionary.",
                "author": "skycake10",
                "created": 1734357897.0
            },
            {
                "body": "Take a second and go and do a search on David Lin on YouTube. He just had a money manager on his latest video called - January Hell For Investors. The money manager put it in a nutshell in a few minutes with facts. But the money manager also said that he sees the markets going back up again mid next year to new highs.",
                "author": "Formal-Plate-8242",
                "created": 1734355651.0
            },
            {
                "body": "Bring it.  I plan to move to a higher COL area in three years.  If my current house loses 25% of its value, it'll be more than offset by the new, more expensive, house's proportional decrease in value.",
                "author": "FrankCobretti",
                "created": 1734359642.0
            },
            {
                "body": "Bring it. These ultra rich need to be knocked down.",
                "author": "MysteriousSun7508",
                "created": 1734357132.0
            },
            {
                "body": "BoA: Butthurt that Buffet left, wants to burn it all down",
                "author": "Amins66",
                "created": 1734358992.0
            },
            {
                "body": "They're not wrong.\n\nDYOR",
                "author": "VIXtrade",
                "created": 1734354892.0
            },
            {
                "body": "Maybe but, imo, we have a long way to go before we have a real bubble let alone danger of it popping.  People were saying the AI bubble was about to pop 6 months ago.  At least when it comes to AI, it's really still so small that all the pure AI companies could go under and all the big companies could stop working on it and it would not collapse the economy.  Last year it would've been barely a blip on the radar, imo.  This year it's a bit more, for sure.  It might cause a big market correction but nothing historically noteworthy.  Again . .imo.",
                "author": "PennyStonkingtonIII",
                "created": 1734357539.0
            },
            {
                "body": "Hi",
                "author": "Tayloralison69",
                "created": 1734359313.0
            }
        ]
    },
    {
        "title": "Reassessing my investment strategy",
        "text": "Hi guys, at the end of each year I reassess my overall investment strategy and the high level allocation. I’m based in Switzerland, so please no 401k etc tips. \n\nSummary (compared vs total net wealth)\n- 10% Cash (3-6 months of expenses plus few extra k in case markets drop a bit)\n- 50% Investment portfolio\n- 40% Pension Funds \n\nMy investment portfolio is roughly 70% ETFs, 25% single stocks and 5% bonds. My Pension Funds is 90% ETFs and 10% bonds. \n\nI’m in the constant balance exercise between the patience that comes with ETFs vs the opportunity of single stocks. I started three years ago and have since moved more and more towards ETFs since I really think it’s hard to beat the SP500. I have had some hits and misses with my stocks but my hits strongly outweigh the misses (so far). Stocks are also more fun, which I don’t know if it’s a good or bad thing.\n\nMy question is the following: should I move further towards ETFs and sell step by step my stock positions? Or should I keep it mixed as today? \n\nI’m 30 years old and no plan to buy real estate here. Potentially in the short to medium term in my home country. \n\nThanks! ",
        "score": 0,
        "url": "https://www.reddit.com/r/investing/comments/1hfilpn/reassessing_my_investment_strategy/",
        "id": "1hfilpn",
        "author": "Due-Butterfly-5790",
        "comments": 0,
        "comment_list": []
    },
    {
        "title": "Do any of you believe in quantum computing stocks?",
        "text": "Versarien PLC could be a good buy due to its strong position in the growing graphene market, a material with transformative applications in quantum computing, electronics, energy storage, and advanced manufacturing. The company holds a portfolio of innovative graphene technologies and partnerships across diverse industries, leveraging graphene’s unique properties like high strength, conductivity, and flexibility. With increasing global demand for graphene-enabled solutions and its potential role in cutting-edge sectors like quantum computing and clean energy, Versarien is well-placed for growth. However, due diligence is essential to assess financial health and market positioning.\n\n\nDo any of you agree w this take?",
        "score": 3,
        "url": "https://www.reddit.com/r/investing/comments/1hfi9p5/do_any_of_you_believe_in_quantum_computing_stocks/",
        "id": "1hfi9p5",
        "author": "Dapper_Ad_3154",
        "comments": 17,
        "comment_list": [
            {
                "body": "Amazon didn't invent online shopping, Google didn't invent the search engine, Apple didn't invent the computer or smartphone, Facebook didn't invent social media. The companies pushing the bleeding edge of tech are almost certain to fail.",
                "author": "UnKossef",
                "created": 1734357202.0
            },
            {
                "body": "Holding patents is key.",
                "author": "MedicalBiostats",
                "created": 1734353294.0
            },
            {
                "body": "Check out QBTS, RGTI, and LAES",
                "author": "Toronto_Stud",
                "created": 1734353724.0
            },
            {
                "body": "I believe they have hype, great speculation short term play \n\n They’ve been around for many years\nHaven’t seen much use since then",
                "author": "Head-Recover-2920",
                "created": 1734353815.0
            },
            {
                "body": "I bought all the stocks a month ago and I'm up 60%",
                "author": "keepmathy",
                "created": 1734355072.0
            },
            {
                "body": "Look into QTUM",
                "author": "_stryker1138_",
                "created": 1734361794.0
            },
            {
                "body": "How's this for making it simple. If you have an AI / ML investment and you don't invest in quantum computing you aren't investing in AI / ML. That's how important it is in the next 5 years.",
                "author": "wirsteve",
                "created": 1734362522.0
            },
            {
                "body": "OP just blatantly shilling and trying to pump the stock. Pathetic.",
                "author": "MikeWhiskeyEcho",
                "created": 1734354030.0
            }
        ]
    }
]